chang01234/test1/DICMFramework/sdkconfig/5.x/sdkconfig.defaults.linux
# target
CONFIG_IDF_TARGET_LINUX=y
CONFIG_IDF_TARGET="linux"

CONFIG_LWIP_ENABLE=y
CONFIG_ESP_SYSTEM_SINGLE_CORE_MODE=y
CONFIG_FREERTOS_UNICORE=y
CONFIG_MDNS_PREDEF_NETIF_STA=y
CONFIG_MDNS_PREDEF_NETIF_AP=y
CONFIG_MDNS_ENABLE_CONSOLE_CLI=n
CONFIG_FREERTOS_USE_TICK_HOOK=y